app/controllers/businesses_controller.rb

  def index
    @businesses = Business.all
---
SELECT * FROM `businesses`

  def show
    @business = Business.find(params[:id])
---
SELECT * FROM `businesses` WHERE (`businesses`.`id` = 1)

  def edit
    @business = Business.find(params[:id])
---
SELECT * FROM `businesses` WHERE (`businesses`.`id` = 1)

  def create
    @business = Business.new(params[:business])

    respond_to do |format|
      if @business.save
---
INSERT INTO `businesses` (`name`, `created_at`, `updated_at`) VALUES('StarBucks', '2009-11-21 01:51:31', '2009-11-21 01:51:31')

  def update
    @business = Business.find(params[:id])

    respond_to do |format|
      if @business.update_attributes(params[:business])
---
SELECT * FROM `businesses` WHERE (`businesses`.`id` = 1)
UPDATE `businesses` SET `updated_at` = '2009-11-22 00:21:51', `name` = 'Clocktower Coffee' WHERE `id` = 1